In [1]:
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
high_schools

['Hernandez High School',
 'Figueroa High School',
 'Wilson High School',
 'Wright High School']

In [3]:
for i in high_schools:
    print(i)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [4]:
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [1]:
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [2]:
high_schools

['Huang High School',
 'Figueroa High School',
 'Shelton High School',
 'Hernandez High School',
 'Griffin High School',
 'Wilson High School',
 'Cabrera High School',
 'Bailey High School',
 'Holden High School',
 'Pena High School',
 'Wright High School',
 'Rodriguez High School',
 'Johnson High School',
 'Ford High School',
 'Thomas High School']

In [4]:
#creating a pandas series: 
import pandas as pd 
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [17]:
#We can use indexing/slicing to get specific items from a Pandas Series like we can from a list in Python.
school_series[2:5]

2      Shelton High School
3    Hernandez High School
4      Griffin High School
dtype: object

In [7]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [8]:
school_dataframe = pd.DataFrame(high_school_dicts)

In [9]:
school_dataframe.set_index("School ID")

                     school_name      type
School ID
0              Huang High School  District
1           Figueroa High School  District
2            Shelton High School   Charter
3          Hernandez High School  District
4            Griffin High School   Charter

In [12]:
school_dataframe.drop(labels = 2, axis = 0)

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [21]:
#school_dataframe.drop("School ID" , inplace = True, axis = 1), drops the school ID column

In [5]:
schools_df = pd.DataFrame()

school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [18]:
schools_df["school_id"] = school_id
schools_df["school_name"] = school_name
schools_df["type_of_school"] = type_of_school
schools_df

   school_id            school_name type_of_school
0          0      Huang High School       District
1          1   Figueroa High School       District
2          2    Shelton High School        Charter
3          3  Hernandez High School       District
4          4    Griffin High School        Charter

In [31]:
high_schools_dict = {'school_id': school_id, 'school_name':school_name, 'type':type_of_school}

In [32]:
school_dataframe = pd.DataFrame(high_schools_dict)

In [33]:
school_dataframe

   school_id            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [16]:
#to get just cols
school_dataframe.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [14]:
#contains the start, stop and step values 
school_dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
#returns an array of values 
school_dataframe.values[0]

array([0, 'Huang High School', 'District'], dtype=object)

In [34]:
new_row = [{"school_id": 5, "school_name": "HHS" , "type" : "Hello"}]

In [35]:
add_this = pd.DataFrame(new_row)

In [36]:
add_this

   school_id school_name   type
0          5         HHS  Hello

In [38]:
#way to add 2 df's together 
pd.concat([school_dataframe , add_this ])

   school_id            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter
0          5                    HHS     Hello